OpenFOAM-7-master/tutorials/combustion/PDRFoam/flamePropagationWithObstacles/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains   4;

method               simple;

simpleCoeffs
{
    n                    (2 2 1);
    delta                0.001;
}

hierarchicalCoeffs
{
    n                    (2 2 1);
    delta                0.001;
    order                xyz;
}

manualCoeffs
{
    dataFile             "decompositionData";
}

// ************************************************************************* //
